tests/performance/k6/results/before/roadmap-enrollment-summary.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/k6/roadmap/roadmap-enrollment.test.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 3 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 3 VUs  00.2s/30s

running (0m02.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 3 VUs  01.2s/30s

running (0m03.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 3 VUs  02.2s/30s

running (0m04.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  11% ] 3 VUs  03.2s/30s

running (0m05.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
default   [  14% ] 3 VUs  04.2s/30s

running (0m06.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
default   [  17% ] 3 VUs  05.2s/30s

running (0m07.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
default   [  21% ] 3 VUs  06.2s/30s

running (0m08.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
default   [  24% ] 3 VUs  07.2s/30s

running (0m09.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
default   [  27% ] 3 VUs  08.2s/30s

running (0m10.0s), 3/3 VUs, 27 complete and 0 interrupted iterations
default   [  31% ] 3 VUs  09.2s/30s

running (0m11.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
default   [  34% ] 3 VUs  10.2s/30s

running (0m12.0s), 3/3 VUs, 33 complete and 0 interrupted iterations
default   [  37% ] 3 VUs  11.2s/30s

running (0m13.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
default   [  41% ] 3 VUs  12.2s/30s

running (0m14.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
default   [  44% ] 3 VUs  13.2s/30s

running (0m15.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
default   [  47% ] 3 VUs  14.2s/30s

running (0m16.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
default   [  51% ] 3 VUs  15.2s/30s

running (0m17.0s), 3/3 VUs, 48 complete and 0 interrupted iterations
default   [  54% ] 3 VUs  16.2s/30s

running (0m18.0s), 3/3 VUs, 51 complete and 0 interrupted iterations
default   [  57% ] 3 VUs  17.2s/30s

running (0m19.0s), 3/3 VUs, 54 complete and 0 interrupted iterations
default   [  61% ] 3 VUs  18.2s/30s

running (0m20.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
default   [  64% ] 3 VUs  19.2s/30s

running (0m21.0s), 3/3 VUs, 60 complete and 0 interrupted iterations
default   [  67% ] 3 VUs  20.2s/30s

running (0m22.0s), 3/3 VUs, 63 complete and 0 interrupted iterations
default   [  71% ] 3 VUs  21.2s/30s

running (0m23.0s), 3/3 VUs, 66 complete and 0 interrupted iterations
default   [  74% ] 3 VUs  22.2s/30s

running (0m24.0s), 3/3 VUs, 69 complete and 0 interrupted iterations
default   [  77% ] 3 VUs  23.2s/30s

running (0m25.0s), 3/3 VUs, 72 complete and 0 interrupted iterations
default   [  81% ] 3 VUs  24.2s/30s

running (0m26.0s), 3/3 VUs, 75 complete and 0 interrupted iterations
default   [  84% ] 3 VUs  25.2s/30s

running (0m27.0s), 3/3 VUs, 78 complete and 0 interrupted iterations
default   [  87% ] 3 VUs  26.2s/30s

running (0m28.0s), 3/3 VUs, 81 complete and 0 interrupted iterations
default   [  91% ] 3 VUs  27.2s/30s

running (0m29.0s), 3/3 VUs, 84 complete and 0 interrupted iterations
default   [  94% ] 3 VUs  28.2s/30s

running (0m30.0s), 3/3 VUs, 87 complete and 0 interrupted iterations
default   [  97% ] 3 VUs  29.2s/30s


  Γûê THRESHOLDS 

    http_req_duration
    Γ£ô 'p(95)<1000' p(95)=2.94ms

    http_req_failed
    Γ£ô 'rate<0.02' rate=0.00%


  Γûê TOTAL RESULTS 

    checks_total.......: 183     5.924683/s
    checks_succeeded...: 100.00% 183 out of 183
    checks_failed......: 0.00%   0 out of 183

    Γ£ô login status is 200
    Γ£ô login returned cookies
    Γ£ô setup graph status is 200
    Γ£ô current enrollment status is 200 or 204
    Γ£ô enroll status is 200 or already-enrolled 400

    HTTP
    http_req_duration..............: avg=5.87ms min=506.8┬╡s med=1.76ms max=686.53ms p(90)=2.23ms p(95)=2.94ms
      { expected_response:true }...: avg=5.87ms min=506.8┬╡s med=1.76ms max=686.53ms p(90)=2.23ms p(95)=2.94ms
    http_req_failed................: 0.00%  0 out of 182
    http_reqs......................: 182    5.892308/s

    EXECUTION
    iteration_duration.............: avg=1s     min=1s      med=1s     max=1.01s    p(90)=1s     p(95)=1s    
    iterations.....................: 90     2.913779/s
    vus............................: 3      min=3        max=3
    vus_max........................: 3      min=3        max=3

    NETWORK
    data_received..................: 253 kB 8.2 kB/s
    data_sent......................: 25 kB  802 B/s



running (0m30.9s), 0/3 VUs, 90 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 3 VUs  30s